accomodation/app/views/adminuser/index.html.erb

        <td><%= user1.email %></td>
        <td><%= @roles.find_by(id: user1.role_id ).name %></td>
---
SELECT  "roles".* FROM "roles" WHERE "roles"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]