accomodation/app/views/adminuser/port.html.erb


<% r1 = Role.find(current_user.role_id).name %>
---
SELECT  "roles".* FROM "roles" WHERE "roles"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]