accomodation/app/views/studenthousinginfos/_form.html.erb

SELECT  "studenthousinginfos".* FROM "studenthousinginfos" WHERE "studenthousinginfos"."category" = $1 LIMIT $2  [["category", "3"], ["LIMIT", 1]]
SELECT MAX("studenthousinginfos"."version") FROM "studenthousinginfos" WHERE "studenthousinginfos"."category" = $1  [["category", "4"]]
---
<% if studenthousinginfo.version.present? then %>
    <%= var_version = Studenthousinginfo.where(category: studenthousinginfo.category).maximum(:version)  %>