accomodation/app/controllers/adminuser_controller.rb

SELECT "users".* FROM "users" ORDER BY "users"."role_id" ASC, "users"."created_at" DESC
SELECT "roles".* FROM "roles"
---
  def index
    @users = User.order(:role_id, created_at: :desc)
    @roles = Role.all

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "banstatus" = $1, "role_id" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["banstatus", "Banned"], ["role_id", 3], ["updated_at", 2016-10-18 01:33:32 UTC], ["id", 2]]
---
  def ban
    user_id = params[:u_id]
    user = User.find(user_id)
    user.banstatus='Banned'
    user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "banstatus" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["banstatus", "not Banned"], ["updated_at", 2016-10-18 06:15:10 UTC], ["id", 7]]
---
  def unban
    user_id = params[:u_id]
    user = User.find(user_id)
    user.banstatus='Active'
    user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "roles".* FROM "roles" WHERE "roles"."name" = $1 LIMIT $2  [["name", "Staff"], ["LIMIT", 1]]
UPDATE "users" SET "role_id" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["role_id", 4], ["updated_at", 2016-10-18 02:04:06 UTC], ["id", 5]]
---
  def staff
    user_id = params[:u_id]
    user = User.find(user_id)
    user.role_id=Role.find_by(name: 'Staff').id
    user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "roles".* FROM "roles" WHERE "roles"."name" = $1 LIMIT $2  [["name", "Manager"], ["LIMIT", 1]]
UPDATE "users" SET "role_id" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["role_id", 2], ["updated_at", 2016-10-18 02:04:17 UTC], ["id", 3]]
---
  def manager
    user_id = params[:u_id]
    user = User.find(user_id)
    user.role_id=Role.find_by(name: 'Manager').id
    user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "roles".* FROM "roles" WHERE "roles"."name" = $1 LIMIT $2  [["name", "Admin"], ["LIMIT", 1]]
UPDATE "users" SET "role_id" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["role_id", 1], ["updated_at", 2016-10-18 02:04:12 UTC], ["id", 4]]
---
  def admin
    user_id = params[:u_id]
    user = User.find(user_id)
    user.role_id=Role.find_by(name: 'Admin').id
    user.save

SELECT "roomlists".* FROM "roomlists" WHERE "roomlists"."status" = $1  [["status", "Waiting"]]
SELECT "studenthousinginfos".* FROM "studenthousinginfos" WHERE "studenthousinginfos"."status" = $1  [["status", "Waiting for Approval"]]
---
  def listroom
    @rooms = Roomlist.where(status: 'Waiting')
    @housinginfo = Studenthousinginfo.where(status: 'Waiting for Approval')

SELECT  "studenthousinginfos".* FROM "studenthousinginfos" WHERE "studenthousinginfos"."version" = $1 AND "studenthousinginfos"."category" = $2 LIMIT $3  [["version", 1], ["category", "2"], ["LIMIT", 1]]
UPDATE "studenthousinginfos" SET "status" = $1, "updated_at" = $2 WHERE "studenthousinginfos"."id" = $3  [["status", "Approved"], ["updated_at", 2016-11-01 11:52:53 UTC], ["id", 2]]
---
  def wf_approve
    @housinginfoapprove = Studenthousinginfo.find_by(version: params[:version], category: params[:category])
    @housinginfoapprove.status = "Approved"
    @housinginfoapprove.save

SELECT  "studenthousinginfos".* FROM "studenthousinginfos" WHERE "studenthousinginfos"."version" = $1 AND "studenthousinginfos"."category" = $2 LIMIT $3  [["version", 1], ["category", "2"], ["LIMIT", 1]]
UPDATE "studenthousinginfos" SET "status" = $1, "updated_at" = $2 WHERE "studenthousinginfos"."id" = $3  [["status", "Rejected"], ["updated_at", 2016-11-01 11:57:09 UTC], ["id", 2]]
---
  def wf_reject
    @housinginfoapprove = Studenthousinginfo.find_by(version: params[:version], category: params[:category])
    @housinginfoapprove.status = "Rejected"
    @housinginfoapprove.save