accomodation/app/controllers/ait_controller.rb

  def dormroom
    @dormdetails = DormDetail.all
---
SELECT "dorm_details".* FROM "dorm_details"