accomodation/app/controllers/quotations_controller.rb

  def index
    @quotations = Quotation.all
---
SELECT "quotations".* FROM "quotations"

  def create

    @quotation = Quotation.new(quotation_params)
    @quotation.user = current_user

    respond_to do |format|
      if @quotation.save
---
INSERT INTO "quotations" ("quote", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["quote", "Q3"], ["created_at", 2016-10-12 19:43:33 UTC], ["updated_at", 2016-10-12 19:43:33 UTC], ["user_id", 1]]

  def update
    @quotation.user = current_user
    respond_to do |format|
      if @quotation.update(quotation_params)
---
UPDATE "quotations" SET "quote" = $1, "updated_at" = $2 WHERE "quotations"."id" = $3  [["quote", "Q3 update"], ["updated_at", 2016-10-12 19:44:56 UTC], ["id", 3]]

    def set_quotation
      @quotation = Quotation.find(params[:id])
---
SELECT  "quotations".* FROM "quotations" WHERE "quotations"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]