accomodation/app/controllers/roomlists_controller.rb

SELECT "roomlists".* FROM "roomlists" WHERE (status != 'Waiting') ORDER BY "roomlists"."created_at" DESC
---
  def index
    #@roomlists = Roomlist.where(["status != ?" , 'Waiting' ]).order(created_at: :desc)
    @roomlists = Roomlist.all.order(:status, created_at: :desc)

SELECT COUNT(*) FROM "roomlists" WHERE "roomlists"."studentid" = $1  [["studentid", "st111111"]]
SELECT COUNT(*) FROM "roomlists" WHERE "roomlists"."cat" = $1 AND "roomlists"."dorm" = $2 AND "roomlists"."room" = $3 AND "roomlists"."abc" = $4  [["cat", "1"], ["dorm", "A"], ["room", "12"], ["abc", "A"]]
INSERT INTO "roomlists" ("cat", "dorm", "room", "abc", "studentid", "status", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"  [["cat", "1"], ["dorm", "A"], ["room", "11"], ["abc", "A"], ["studentid", "st111111"], ["status", "Allocate"], ["created_at", 2016-10-17 04:22:46 UTC], ["updated_at", 2016-10-17 04:22:46 UTC]]
---
  def create

    @allrooms = Roomlist.all
    allocatedflag = 'No'
    note = ''
    @roomlist = Roomlist.new(roomlist_params)
    @roomlist.status = 'Waiting'

    if @allrooms.where(studentid: @roomlist.studentid).count != 0
      note = 'student already has room, you must first deallocated him'
      allocatedflag = 'YesStudent'
    elsif @allrooms.where(cat: @roomlist.cat,dorm: @roomlist.dorm ,room: @roomlist.room,abc: @roomlist.abc).count != 0 then
      note = 'Room is already taken, you must first deallocated it'
      allocatedflag = 'YesRoom'
      end

    if allocatedflag != 'No'
      # redirect_to action: :index , flash: { notice: "Watch it, mister!" }
      redirect_to roomlists_path , flash: { notice: note } and return false
    end

    respond_to do |format|
      if @roomlist.save

UPDATE "roomlists" SET "studentid" = $1, "updated_at" = $2 WHERE "roomlists"."id" = $3  [["studentid", "st118858"], ["updated_at", 2016-10-31 18:06:37 UTC], ["id", 16]]
---
  def update
    respond_to do |format|
      if @roomlist.update(roomlist_params)

DELETE FROM "roomlists" WHERE "roomlists"."id" = $1  [["id", 3]]
---
  def destroy
    @roomlist.destroy

SELECT  "roomlists".* FROM "roomlists" WHERE "roomlists"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
    def set_roomlist
      @roomlist = Roomlist.find(params[:id])