accomodation/app/controllers/studenthousinginfos_controller.rb

  def index
    @studenthousinginfos = Studenthousinginfo.all
---
SELECT "studenthousinginfos".* FROM "studenthousinginfos"

  def create
    @studenthousinginfo = Studenthousinginfo.new(studenthousinginfo_params)
    @studenthousinginfo.status = 'Waiting for Approval'

    respond_to do |format|
      if @studenthousinginfo.save
---
INSERT INTO "studenthousinginfos" ("version", "category", "roomsize", "rent", "detail", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["version", 1], ["category", "1"], ["roomsize", 33], ["rent", 2000], ["detail", "Single Room No AC"], ["created_at", 2016-10-31 19:19:21 UTC], ["updated_at", 2016-10-31 19:19:21 UTC]]

  def update
    before_update

    @studenthousinginfo.status = 'Waiting for Approval'

    respond_to do |format|
      if @studenthousinginfo.update(studenthousinginfo_params)
---
UPDATE "studenthousinginfos" SET "status" = $1, "version" = $2, "rent" = $3, "updated_at" = $4 WHERE "studenthousinginfos"."id" = $5  [["status", "Waiting"], ["version", 6], ["rent", 2503], ["updated_at", 2016-11-02 08:16:30 UTC], ["id", 2]]

  def destroy
    @studenthousinginfo.destroy
---
DELETE FROM "studenthousinginfos" WHERE "studenthousinginfos"."id" = $1  [["id", 5]]

    def set_studenthousinginfo
      @studenthousinginfo = Studenthousinginfo.find(params[:id])
---
SELECT  "studenthousinginfos".* FROM "studenthousinginfos" WHERE "studenthousinginfos"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]